/*2152590 王琳*/
#include <iostream>
using namespace std;

/*
* 命题变元定义：
A:营业员A偷了手表
B:营业员B偷了手表
C:作案不在营业时间
D:B提供的证据正确
E:货柜未上锁
*/

/*
（1）营业员A或B偷了手表；A || B
（2）若A作案，则作案不在营业时间；将其转换为命题逻辑表达式 A->C,！A\/C将联结词转换成逻辑运算符即得  !A || C
（3）若B提供的证据正确，则货柜未上锁；D->E推理过程同上    !D || E
（4）若B提供的证据不正确，则作案发生在营业时间；！D->!C   D || !C
（5）货柜上了锁。!E
*/
int main()
{
	int A, B, C, D, E;
	for (A = 0; A <= 1; A++)
		for (B = 0; B <= 1; B++)
			for (C = 0; C <= 1; C++)
				for (D = 0; D <= 1; D++)
					for (E = 0; E <= 1; E++)
						if ((A || B) && (!A || C) && (!D || E) && (D || !C) && !E)
							cout << "A = " << A << " B = " << B << endl;
							
	return 0;
}

/*
通过for循环嵌套给不同命题变元分别进行赋值，每个命题变元都只有0和1赋值；
其中A为0时表明不是A偷的手表，A为1时表明是A偷的手表，B同理；
将逻辑推理过程转换为表达式；即
将所有条件一起考虑，最终得出使得所有条件都符合的运算结果打印出来；


*/